# Notebook 2

Ejercicio 1.  ¿De qué podría servir esta base de datos? ¿Cuál era su aplicación probable? 
              ¿Cuál sería una adaptación posible más moderna?

Podría servir para una tienda de alquiler de videos, como antiguamente lo era blockbuster.
La aplicación de la bd era buscar películas mediante sus características para el posterior arriendo de esta.
Una adaptación moderna: podría ser utilizarla para Netflix.

In [2]:
import mysql.connector
import pandas as pd
from IPython.display import display,HTML

db_connection = mysql.connector.connect(user="root",host="localhost",password="94209420")
cursor = db_connection.cursor()
cursor.execute("USE sakila")

In [3]:
df = pd.read_sql('SELECT title FROM film LIMIT 10;', con=db_connection)
display(df)

              title
0  ACADEMY DINOSAUR
1    ACE GOLDFINGER
2  ADAPTATION HOLES
3  AFFAIR PREJUDICE
4       AFRICAN EGG
5      AGENT TRUMAN
6   AIRPLANE SIERRA
7   AIRPORT POLLOCK
8     ALABAMA DEVIL
9  ALADDIN CALENDAR

In [4]:
df = pd.read_sql('SELECT DISTINCT release_year FROM film LIMIT 10;', con=db_connection)
display(df)

   release_year
0          2006

In [8]:
df = pd.read_sql('SELECT title, rental_duration '+'FROM film '+'WHERE rental_duration >= 4 LIMIT 10;', con=db_connection)
display(df)

              title  rental_duration
0  ACADEMY DINOSAUR                6
1  ADAPTATION HOLES                7
2  AFFAIR PREJUDICE                5
3       AFRICAN EGG                6
4   AIRPLANE SIERRA                6
5   AIRPORT POLLOCK                6
6  ALADDIN CALENDAR                6
7   ALAMO VIDEOTAPE                6
8    ALASKA PHANTOM                6
9       ALI FOREVER                4

In [ ]:
df = pd.read_sql('SELECT ')